In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv("Placement.csv")

In [3]:
dataset

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [4]:
dataset["ssc_p"].mean()

67.3033953488372

In [5]:
dataset["ssc_p"].median()

67.0

In [6]:
dataset["ssc_p"].mode()[0]

62.0

In [26]:
#sl_no remove
datasets=dataset.drop("sl_no",axis=1)

In [27]:
from uni import univariate
obj=univariate()
quan,qual=obj.QuanQual(datasets)

gender Qual
ssc_p Quan
ssc_b Qual
hsc_p Quan
hsc_b Qual
hsc_s Qual
degree_p Quan
degree_t Qual
workex Qual
etest_p Quan
specialisation Qual
mba_p Quan
status Qual
salary Quan

In [34]:
uni=pd.DataFrame(index=["mean","median","mode"],columns=quan)

In [35]:
uni

       ssc_p hsc_p degree_p etest_p mba_p salary
mean     NaN   NaN      NaN     NaN   NaN    NaN
median   NaN   NaN      NaN     NaN   NaN    NaN
mode     NaN   NaN      NaN     NaN   NaN    NaN

In [36]:
uni["ssc_p"]["mean"]

nan

In [37]:
uni["ssc_p"]["mean"]=datasets["ssc_p"].mean()

In [38]:
uni

            ssc_p hsc_p degree_p etest_p mba_p salary
mean    67.303395   NaN      NaN     NaN   NaN    NaN
median        NaN   NaN      NaN     NaN   NaN    NaN
mode          NaN   NaN      NaN     NaN   NaN    NaN

In [40]:
for columnName in quan:
    uni[columnName]["mean"]=datasets[columnName].mean()

In [41]:
uni

            ssc_p      hsc_p   degree_p    etest_p      mba_p         salary
mean    67.303395  66.333163  66.370186  72.100558  62.278186  288655.405405
median        NaN        NaN        NaN        NaN        NaN            NaN
mode          NaN        NaN        NaN        NaN        NaN            NaN

In [42]:
for columnName in quan:
    uni[columnName]["mean"]=datasets[columnName].mean()
    uni[columnName]["median"]=datasets[columnName].median()

In [43]:
uni

            ssc_p      hsc_p   degree_p    etest_p      mba_p         salary
mean    67.303395  66.333163  66.370186  72.100558  62.278186  288655.405405
median       67.0       65.0       66.0       71.0       62.0       265000.0
mode          NaN        NaN        NaN        NaN        NaN            NaN

In [46]:
for columnName in quan:
    uni[columnName]["mean"]=datasets[columnName].mean()
    uni[columnName]["median"]=datasets[columnName].median()
    uni[columnName]["mode"]=datasets[columnName].mode()[0]

In [47]:
uni

            ssc_p      hsc_p   degree_p    etest_p      mba_p         salary
mean    67.303395  66.333163  66.370186  72.100558  62.278186  288655.405405
median       67.0       65.0       66.0       71.0       62.0       265000.0
mode         62.0       63.0       65.0       60.0       56.7       300000.0